isc-fs/stm32-can-bootloader/Core/Src/main.c
	/* Bus_Off is set. Act on the first detection, then rate-limited. */
	if (s_was_busoff != 0U &&
	    (now_ms - s_last_attempt_ms) < BL_FDCAN_BUSOFF_RETRY_MS) {
		return;
	}
	s_was_busoff      = 1U;
	s_last_attempt_ms = now_ms;

	/* Stop/Start to clear INIT and rejoin. Errors are non-fatal — we
	 * retry on the next poll; nothing else we can do but keep trying. */
	(void)HAL_FDCAN_Stop(bl_fdcan_get_handle());
	(void)HAL_FDCAN_Start(bl_fdcan_get_handle());

	bl_health_record_fdcan_recovery();
	bl_dtc_log(BL_DTC_FDCAN_BUSOFF, BL_DTC_SEV_WARN,
	           bl_health_fdcan_recovery_count());
	bl_log_warn("FDCAN bus-off — Stop/Start recovery #%u",
	            (unsigned int)bl_health_fdcan_recovery_count());
}

/* #125 H3: max RX frames drained per main-loop pass. Sized to the
 * RX_FIFO0 depth (MX_FDCAN2_Init's RxFifo0ElmtsNbr = 16) so a full
 * FIFO can be cleared in one pass, while bounding the work so the
 * per-pass ticks (session watchdog, bus-off recovery) always run. */
#define BL_FDCAN_RX_DRAIN_BUDGET   16U

static void Bootloader_MainLoop(void) {
	FDCAN_RxHeaderTypeDef rxHeader;
	uint8_t rxData[8];

	while (1) {
		/* #125 H6: kick the hardware watchdog every iteration. The loop
		 * body is sub-millisecond except when a dispatch triggers a flash
		 * erase — and bl_flash_erase / bl_nvm refresh between sectors
		 * themselves, so the longest gap between kicks is a single ~1.8 s
		 * sector erase, well inside the ~8 s IWDG period. */
		bl_iwdg_refresh();

		/* Drain pending RX frames — each cancels the auto-jump and is
		 * handed to the protocol dispatcher.
		 *
		 * #125 H3: drain up to a bounded BATCH per loop pass (the FIFO
		 * is only 16 deep). The old one-frame-per-pass let RX_FIFO0
		 * overflow after any stall — a blocking flash op, or the
		 * per-tick work below — because the host streams CFs at ~3 kHz
		 * during a multi-frame transfer. Draining a batch clears a
		 * post-stall backlog in a single pass; the budget cap means a
		 * continuous host flood still can't starve the ticks (session
		 * watchdog, bus-off recovery) at the bottom of the loop. */
		uint8_t rx_budget = BL_FDCAN_RX_DRAIN_BUDGET;
		while (rx_budget > 0U &&
		       HAL_FDCAN_GetRxFifoFillLevel(bl_fdcan_get_handle(), FDCAN_RX_FIFO0) > 0U) {
			rx_budget--;
			if (HAL_FDCAN_GetRxMessage(bl_fdcan_get_handle(),
			FDCAN_RX_FIFO0, &rxHeader, rxData) == HAL_OK) {

				/* The bootloader only speaks classic 11-bit IDs; any
				 * extended-ID frame is ignored entirely. */
				if (rxHeader.IdType == FDCAN_STANDARD_ID) {
					g_AutoJumpEnabled = 0U;

					bl_proto_id_t id;
					/* `bl_proto_parse_id` returns false on malformed
					 * IDs (bits 10..5 set, or reserved node→host node
					 * IDs). The FDCAN filter already rejects anything
					 * we can't decode, so in practice this guard is
					 * defence-in-depth against future filter drift
					 * or loopback-harness feeds. On false we skip the
					 * dispatch but still fall through to the tick
					 * block below, so session watchdogs keep running. */
					if (bl_proto_parse_id(rxHeader.Identifier, &id)) {
						/* `HAL_FDCAN_GetRxMessage` already extracts the DLC
						 * nibble into bits 3:0 of rxHeader.DataLength
						 * (see `FDCAN_ELEMENT_MASK_DLC >> 16U` in the
						 * STM32H7 HAL). For classic CAN the DLC value
						 * equals the byte count, so we just mask to the
						 * low nibble — NO extra shift. Earlier versions
						 * shifted >>16 again, which zeroed out every
						 * length and silently dropped every incoming
						 * frame at bl_proto_dispatch's `length == 0U`
						 * gate. */
						uint8_t length = (uint8_t)(rxHeader.DataLength & 0x0FU);
						if (length > 8U) {
							length = 8U;
						}

						bl_proto_dispatch(&id, rxData, length);
					}
				}
			}
		}

		/* Protocol tick — drives ISO-TP reassembly timeout. NACKs any
		 * peer whose multi-frame transfer stalled past BL_ISOTP_TIMEOUT_MS. */
		uint32_t tick_now = HAL_GetTick();
		bl_proto_tick(tick_now);
		bl_health_tick(tick_now);
		bl_log_tick(tick_now);
		bl_live_tick(tick_now);

		/* #125 C1: FDCAN bus-off auto-recovery. If a hard bus fault
		 * (sustained TX-arbitration loss, dominant-bit fault) drove
		 * the node into Bus_Off, the M_CAN sets CCCR.INIT and stops
		 * TX + RX — the BL would otherwise be permanently deaf until a
		 * power-cycle, i.e. unflashable over CAN. This rejoins the bus
		 * automatically. */
		Bootloader_FdcanBusOffRecover(tick_now);

		/* Auto-jump window: if we booted with a valid app and nobody
		 * has talked to us before the deadline, hand control over. */
		if (g_AutoJumpEnabled) {
			uint32_t now = HAL_GetTick();

			if ((int32_t)(now - g_AutoJumpDeadline) >= 0) {
				g_AutoJumpEnabled = 0U;

				if (Bootloader_CheckApplication() == 0x00) {
					Bootloader_JumpToApplication();
				} else {
					LED_ERR_ON();
				}
			}
		}

		/* NO HAL_Delay() here — the previous `HAL_Delay(1)` capped the
		 * main loop at 1 kHz, which made the BL drain FDCAN RX_FIFO0 at
		 * 1 kHz. At 500 kbps the host emits classic-CAN CFs at ~3 kHz
		 * (one frame every ~330 µs), so RX_FIFO0 (depth 16) overflowed
		 * mid-burst on every multi-frame WRITE_CHUNK. The
		 * reassembler then saw a sequence gap and NACKed with
		 * BL_NACK_TRANSPORT_ERROR — issue #94 Bug A (the bench-side
		 * symptom that the AutoRetransmission fix didn't address).
		 *
		 * Polling at MHz scale is fine here: the bootloader is wall-
		 * powered, has no power budget to defend, and the bl_*_tick
		 * functions above all enforce their own emission cadences
		 * internally so they don't get noisy under a fast loop. The
		 * audit-follow-up "drain in ISR" remains a future option but
		 * isn't needed once the artificial throttle is removed. */
	}
}

/* Bootloader_ConfigFdcanFilters body has moved to
 * `bl_fdcan_configure_filters` in bl_fdcan.c (#120 Phase A). The
 * filter geometry is instance-agnostic; the only thing that changed
 * is the handle it operates on, which is what justified the move. */

/* ===================== JUMP TO APPLICATION ====================== */

void Bootloader_JumpToApplication(void) {
	uint32_t appStack = *(__IO uint32_t*) BL_APP_BASE;       // 0x08020000
	uint32_t appEntry = *(__IO uint32_t*) (BL_APP_BASE + 4U); // 0x08020004
	pFunction JumpToApp = (pFunction) appEntry;

	/* --- Basic healthchecks --- */

	/* 1) Stack pointer in valid RAM (DTCM or RAM_D1) — same predicate
	 *    Bootloader_CheckApplication uses, so a metadata-approved app
	 *    can't be silently rejected here. See bl_app_validate.h. */
	if (!bl_app_stack_in_legal_range(appStack)) {
		LED_ERR_ON();
		return;
	}

